# Задача 1. В каждой группе учится от 20 до 30 студентов. По итогам экзамена все оценки заносятся в таблицу. Каждой группе отведена своя строка.
# Определите группу с наилучшим средним баллом.

# Задача 2. Дана квадратная матрица, заполненная случайными числами. Определите, сумма элементов каких строк превосходит сумму главной диагонали матрицы.

# Задача 3. В двумерном массиве хранятся средние дневные температуры с мая по сентябрь за прошлый год. Каждому месяцу соответствует своя строка. 
# Определите самый жаркий и самый холодный 7-дневный промежуток этого периода. Выведите его даты.

# Задача 4* (Дополнительная). Реализуйте игру «Поле чудес». Вопрос и правильный ответ сохраните в файл. Реализуйте алгоритм шифрования правильного ответа.